Revit 2026 API

# CategoryGetBuiltInCategoryTypeId Method

---

Gets the ForgeTypeId identifying the given built-in category.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId GetBuiltInCategoryTypeId(
	BuiltInCategory categoryId
)
```
```vb
Public Shared Function GetBuiltInCategoryTypeId (
	categoryId As BuiltInCategory
) As ForgeTypeId
```
```cpp
public:
static ForgeTypeId^ GetBuiltInCategoryTypeId(
	BuiltInCategory categoryId
)
```
```fsharp
static member GetBuiltInCategoryTypeId :
        categoryId : BuiltInCategory -> ForgeTypeId
```

#### Parameters

categoryId BuiltInCategory
     The built-in category.

#### Return Value

ForgeTypeId The identifier of the given built-in category.

| Exception | Condition |
| --- | --- |
| ArgumentException | categoryId is not a valid built-in category. See Category.IsBuiltInCategoryValid(BuiltInCategory). |

The given BuiltInCategory value must be valid according to Category.IsBuiltInCategoryValid(BuiltInCategory).

#### Reference

Category Class

Autodesk.Revit.DB Namespace